Revit 2026 API

# TransferringProjectStandardsEventArgs Class

---

The event arguments used by the TransferringProjectStandards event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.UI.EventsTransferringProjectStandardsEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransferringProjectStandardsEventArgs : RevitAPIPreDocEventArgs
```
```vb
Public Class TransferringProjectStandardsEventArgs
	Inherits RevitAPIPreDocEventArgs
```
```cpp
public ref class TransferringProjectStandardsEventArgs : public RevitAPIPreDocEventArgs
```
```fsharp
type TransferringProjectStandardsEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
```

The TransferringProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExternalItems | Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | SetExternalItems |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace